/* 
Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

M = 1; N = 15 -> 120
M = 4; N = 8. -> 30
 */



int m = InputNumbers("Введите m: ");
int n = InputNumbers("Введите n: ");
int temp = m;


PrintSumm(m, n, temp = 0);

void PrintSumm(int m, int n, int summ)
{
    summ = summ + n;
    if (n <= m)
    {
        Console.Write($"Сумма элементов= {summ} ");
        return;
    }
    PrintSumm(m, n - 1, summ);
}

int InputNumbers(string input)
{
    Console.Write(input);
    int output = Convert.ToInt32(Console.ReadLine());
    return output;
}






/* 
int Sum(int M, int N)
{
  if(M<=N) return Sum(M+1,N)+M;
  else
    return 0;
}

Console.WriteLine(Sum(1,15));
*/


