// 8. Вывести на экран числа от -N до N

int i = 0;
int N = 19;
int M = -10;

while(i < N)
{
    M = M + 1;
    Console.WriteLine($"{M}");
    i++;
}